In [4]:
import numpy as np
import pandas as pd

# Pandas Metodları ve Özellikleri

### Veri Analizi için Önemli Konular

#### Eksik Veriler (Missing Value)

In [6]:
data = {'Istanbul':[30,29,np.nan],'Ankara':[20,np.nan,25],'Izmir':[40,39,38],'Antalya':[40,np.nan,np.nan]}
weather = pd.DataFrame(data,index=['pzt','sali','car'])
weather

      Istanbul  Ankara  Izmir  Antalya
pzt       30.0    20.0     40     40.0
sali      29.0     NaN     39      NaN
car        NaN    25.0     38      NaN

Satırında değer olmayan satırları veya sütunları silmek için **dropna** fonksiyonu kullanılır.

In [7]:
weather.dropna()

     Istanbul  Ankara  Izmir  Antalya
pzt      30.0    20.0     40     40.0

In [8]:
weather.dropna(axis=1)

      Izmir
pzt      40
sali     39
car      38

In [10]:
# sütunda 2 veya daha fazla nan var ise siler.
weather.dropna(axis=1, thresh=2)

      Istanbul  Ankara  Izmir
pzt       30.0    20.0     40
sali      29.0     NaN     39
car        NaN    25.0     38

Boş olan değerleri doldurmak için **fillna** fonksiyonunu kullanırız.

In [11]:
weather.fillna(22)

      Istanbul  Ankara  Izmir  Antalya
pzt       30.0    20.0     40     40.0
sali      29.0    22.0     39     22.0
car       22.0    25.0     38     22.0

#### Gruplama (Group By)

In [14]:
data = {'Departman':['Yazılım','Pazarlama','Yazılım','Pazarlama','Hukuk','Hukuk'],
        'Calisanlar':['Ahmet','Mehmet','Enes','Burak','Zeynep','Fatma'],
        'Maas':[150,100,200,300,400,500]}

In [15]:
workers = pd.DataFrame(data)
workers

   Departman Calisanlar  Maas
0    Yazılım      Ahmet   150
1  Pazarlama     Mehmet   100
2    Yazılım       Enes   200
3  Pazarlama      Burak   300
4      Hukuk     Zeynep   400
5      Hukuk      Fatma   500

In [17]:
groupbyobje = workers.groupby('Departman')

In [18]:
groupbyobje.count()

           Calisanlar  Maas
Departman
Hukuk               2     2
Pazarlama           2     2
Yazılım             2     2

In [19]:
groupbyobje.mean()

            Maas
Departman
Hukuk      450.0
Pazarlama  200.0
Yazılım    175.0

In [20]:
groupbyobje.min()

          Calisanlar  Maas
Departman
Hukuk          Fatma   400
Pazarlama      Burak   100
Yazılım        Ahmet   150

In [21]:
groupbyobje.max()

          Calisanlar  Maas
Departman
Hukuk         Zeynep   500
Pazarlama     Mehmet   300
Yazılım         Enes   200

In [22]:
groupbyobje.describe()

           Maas
          count   mean         std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0   70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  200.0  141.421356  100.0  150.0  200.0  250.0  300.0
Yazılım     2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0

#### Concatenation

In [23]:
data1 = {'Isim':['Ahmet','Mehmet','Zeynep','Enes'],
        'Spor':['Koşu','Yüzme','Koşu','Basketbol'],
        'Kalori':[100,200,300,400]}

data2 = {'Isim':['Osman','Levent','Atlas','Fatma'],
        'Spor':['Koşu','Yüzme','Koşu','Basketbol'],
        'Kalori':[200,200,30,400]}

data3 = {'Isim':['Ayse','Mahmut','Duygu','Nur'],
        'Spor':['Koşu','Yüzme','Badminton','Tenis'],
        'Kalori':[150,200,350,400]}

In [24]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [29]:
pd.concat([df1,df2,df3], ignore_index=True, axis=0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Enes  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     200
6    Atlas       Koşu      30
7    Fatma  Basketbol     400
8     Ayse       Koşu     150
9   Mahmut      Yüzme     200
10   Duygu  Badminton     350
11     Nur      Tenis     400

#### Merging

In [33]:
mdata1 = {'Isim':['Ahmet','Mehmet','Zeynep','Enes'],
        'Spor':['Koşu','Yüzme','Koşu','Basketbol']}

mdata2 = {'Isim':['Ahmet','Mehmet','Zeynep','Enes'],
        'Kalori':[100,200,300,400]}

In [34]:
mdf1 = pd.DataFrame(mdata1)
mdf1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Enes  Basketbol

In [35]:
mdf2 = pd.DataFrame(mdata2)
mdf2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     300
3    Enes     400

In [36]:
pd.merge(mdf1,mdf2,on='Isim')

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Enes  Basketbol     400

### Önemli Metodlar ve Özellikleri

In [2]:
data = {'Departman' : ['Yazılım','Pazarlama','Yazılım','Pazarlama','Hukuk','Hukuk'],
        'Isim' : ['Ahmet','Mehmet','Enes','Burak','Zeynep','Fatma'],
        'Maas' : [150,100,200,300,400,500]}

In [5]:
workerdf = pd.DataFrame(data)
workerdf

   Departman    Isim  Maas
0    Yazılım   Ahmet   150
1  Pazarlama  Mehmet   100
2    Yazılım    Enes   200
3  Pazarlama   Burak   300
4      Hukuk  Zeynep   400
5      Hukuk   Fatma   500

#### Unique Değerleri Listeleme ve Sayısını Bulma

In [5]:
workerdf['Departman'].unique()

array(['Yazılım', 'Pazarlama', 'Hukuk'], dtype=object)

In [6]:
workerdf['Departman'].nunique()

3

#### Sütundaki Değerlerden Toplamda Kaçar Adet Var?

In [7]:
workerdf['Departman'].value_counts()

Yazılım      2
Pazarlama    2
Hukuk        2
Name: Departman, dtype: int64

#### Değerler Üzerinde Fonksiyon Yardımı ile İşlemler Yapmak

In [8]:
workerdf['Maas'].apply(lambda maas : maas*0.66)

0     99.0
1     66.0
2    132.0
3    198.0
4    264.0
5    330.0
Name: Maas, dtype: float64

#### Dataframe'de Null Değer Var mı?

In [9]:
workerdf.isnull()

   Departman   Isim   Maas
0      False  False  False
1      False  False  False
2      False  False  False
3      False  False  False
4      False  False  False
5      False  False  False

#### Pivot Table

In [10]:
characters = {'Karakter Sınıfı':['South Park','South Park','Simpson','Simpson','Simpson'],
            'Karakter Ismi':['Cartman','Kenny','Homer','Bart','Bart'],
            'Puan':[9,10,50,20,10]}

In [11]:
dfcharacters = pd.DataFrame(characters)
dfcharacters

  Karakter Sınıfı Karakter Ismi  Puan
0      South Park       Cartman     9
1      South Park         Kenny    10
2         Simpson         Homer    50
3         Simpson          Bart    20
4         Simpson          Bart    10

In [12]:
dfcharacters.pivot_table(values='Puan',index=['Karakter Sınıfı','Karakter Ismi'],aggfunc=np.sum)

                               Puan
Karakter Sınıfı Karakter Ismi
Simpson         Bart             30
                Homer            50
South Park      Cartman           9
                Kenny            10

#### Belli Bir Sütuna Göre Değerleri Sıralama (Sorting)

In [6]:
workerdf.sort_values(by='Maas', ascending=False)

   Departman    Isim  Maas
5      Hukuk   Fatma   500
4      Hukuk  Zeynep   400
3  Pazarlama   Burak   300
2    Yazılım    Enes   200
0    Yazılım   Ahmet   150
1  Pazarlama  Mehmet   100